{
  "v5dmwhx": {
    "video_id": "v5dmwhx",
    "video_url": "https://rumble.com/v5dmwhx-kamalas-empty-words-benny-johnson.html?e9s=src_v1_ucp",
    "video_title": "Kamala's EMPTY Words | Benny Johnson",
    "video_host": "Benny Johnson",
    "video_duration": "13:37",
    "video_duration_s": 817,
    "video_thumbnail_url": "https://1a-1791.com/video/s8/1/f/8/Q/y/f8Qyt.oq1b.2-small-Kamalas-EMPTY-Words-Benny-J.jpg",
    "video_source_url": "https://1a-1791.com/video/s8/2/f/8/Q/y/f8Qyt.caa.rec.mp4?u=3&b=0",
    "channel_name": "https://rumble.com/c/TENETmedia",
    "video_date": "2024-09-04T19:00:05+00:00",
    "video_views": 8400,
    "upvotes_count": 80,
    "downvotes_count": 3,
    "video_description": "Benny Johnson and Tim Murtagh discuss Kamala's complete lack of conviction or consistency.",
    "video_description_cont": [
      "Connect with TENET Media:",
      "https://twitter.com/watchTENETnowhttps://www.facebook.com/watchTENEThttps://www.instagram.com/watchtenet/https://www.tiktok.com/@watchtenethttps://www.youtube.com/@watchTENEThttps://rumble.com/c/c-5080150https://www.tenetmedia.com/"
    ],
    "video_tags": [
      "News"
    ],
    "video_comment_number": 75,
    "comments": [
      {
        "comment_index": 0,
        "comment_text": "I heard TENET Media was banned on YT, so now I follow them on Rumble!!!!!!",
        "num_likes": 13,
        "num_replies": 2,
        "low_scored": true,
        "username_hash": "x555878aa98066637"
      },
      {
        "comment_index": 1,
        "comment_text": "Pray for RT news and Tenet.  God bless them and free them.",
        "num_likes": 4,
        "num_replies": 1,
        "low_scored": false,
        "username_hash": "47522f6251808e98"
      },
      {
        "comment_index": 2,
        "comment_text": "She's a Fake Fony Fraud!!!",
        "num_likes": 3,
        "num_replies": 0,
        "low_scored": false,
        "username_hash": "x555878aa98066637"
      },
      {
        "comment_index": 3,
        "comment_text": "We love you Tenet",
        "num_likes": 3,
        "num_replies": 1,
        "low_scored": false,
        "username_hash": "1af378e7a8f87c24"
      },
      {
        "comment_index": 4,
        "comment_text": "Free Lauren Chen! The Jews want to crush all opposition to Israel and Ukraine...",
        "num_likes": 3,
        "num_replies": 2,
        "low_scored": false,
        "username_hash": "52d69853c2dfef64"
      },
      {
        "comment_index": 5,
        "comment_text": "So no issues this season. The uniparty agrees on Israel and there will be no debating it",
        "num_likes": 2,
        "num_replies": 1,
        "low_scored": false,
        "username_hash": "x26028a9fd839421f"
      },
      {
        "comment_index": 6,
        "comment_text": "Rachel MadCow from msLSD said if Trump wins, she's going to a 'camp!!!!\"",
        "num_likes": 1,
        "num_replies": 1,
        "low_scored": true,
        "username_hash": "x555878aa98066637"
      },
      {
        "comment_index": 7,
        "comment_text": "CBC is reporting that Tenet media is Russian propaganda paid by the Russians. Can Tenet media please comment on this? Is this straight up lies fed from intelligence agencies?",
        "num_likes": 1,
        "num_replies": 5,
        "low_scored": false,
        "username_hash": "x44f4aa3e87df1f6f"
      },
      {
        "comment_index": 8,
        "comment_text": "for all of y'all commenting and supporting them... they've really hurt the credibility of a lot of conservative hosts. the hosts that you're watching on here don't seem to support this company anymore. it really seems like Lauren chen and this company did the bidding of the Democrats in this situation by setting up some of our biggest voices. I just don't know if I would be so quick to support this company that just threw a bomb in the conservative movement right before an election.",
        "num_likes": 1,
        "num_replies": 2,
        "low_scored": false,
        "username_hash": "4974a64c1652952b"
      },
      {
        "comment_index": 9,
        "comment_text": "Hope you're able to come back.",
        "num_likes": 1,
        "num_replies": 1,
        "low_scored": false,
        "username_hash": "5a11e961e07391ae"
      },
      {
        "comment_index": 10,
        "comment_text": "Best I could tell, Kamala was saying that Trump wants to \"terminate\" (?) the Constitution. (?)  What?  I thought that the Dems weren't too keen on the Constitution these days, so they should be all for that.",
        "num_likes": 1,
        "num_replies": 1,
        "low_scored": true,
        "username_hash": "6d6f181c78409685"
      },
      {
        "comment_index": 11,
        "comment_text": "Supreme Court I think",
        "num_likes": 1,
        "num_replies": 1,
        "low_scored": false,
        "username_hash": "1f1fe9230504e64d"
      },
      {
        "comment_index": 12,
        "comment_text": "Your right, it's all about nothing. She's having her Seinfeld moment",
        "num_likes": 0,
        "num_replies": 1,
        "low_scored": false,
        "username_hash": "x1ce7f4da0d031505"
      },
      {
        "comment_index": 13,
        "comment_text": "So glad I heard about Tenet media recently, now I can support them.  I am an evangelical for Putin.",
        "num_likes": 0,
        "num_replies": 1,
        "low_scored": false,
        "username_hash": "47522f6251808e98"
      },
      {
        "comment_index": 14,
        "comment_text": "so tenets done done?",
        "num_likes": 0,
        "num_replies": 1,
        "low_scored": false,
        "username_hash": "5571f1defde0485e"
      },
      {
        "comment_index": 15,
        "comment_text": "Do you remember back when Joe was senile but all the RINO's covered for him and cried about not wanting to depose Joe since that would mean facing Kamala?",
        "num_likes": 0,
        "num_replies": 0,
        "low_scored": false,
        "username_hash": "7ddf5ac8fe3d8f21"
      },
      {
        "comment_index": 16,
        "comment_text": "I think she facilitated the movement of RFK Jr. to the GOP. Either Kennedy may move into the position of running mate if Vance & Trump facilitate. If not,  he will run for the GOP nomination in 2028.",
        "num_likes": 0,
        "num_replies": 0,
        "low_scored": true,
        "username_hash": "x1ce7f4da0d031505"
      },
      {
        "comment_index": 17,
        "comment_text": "idiot",
        "num_likes": 0,
        "num_replies": 0,
        "low_scored": true,
        "username_hash": "x7b4eaaed0a1f362d"
      },
      {
        "comment_index": 18,
        "comment_text": "You are too dumb to see that this is a setup",
        "num_likes": 0,
        "num_replies": 0,
        "low_scored": true,
        "username_hash": "x33c768b6222e9ee9"
      },
      {
        "comment_index": 19,
        "comment_text": "More of you ruzzian asshats will be exposed. Get the popcorn.",
        "num_likes": 0,
        "num_replies": 0,
        "low_scored": true,
        "username_hash": "x6b26db8f5c55d641"
      },
      {
        "comment_index": 20,
        "comment_text": "Did Tenet Media receive Russian funding?",
        "num_likes": 0,
        "num_replies": 1,
        "low_scored": true,
        "username_hash": "x2f32fba7feb857d6"
      },
      {
        "comment_index": 21,
        "comment_text": "Wow, you dumbass Russian puppet piece of s***",
        "num_likes": 0,
        "num_replies": 3,
        "low_scored": true,
        "username_hash": "58144155d3eb43dd"
      }
    ],
    "transcript": "So you've been lighting them up on X saying that Kamala Harris is a phony, that she effectively is delivering word salads that would make a sweet green barista blush. What's going on with this interview? You've seen some of the clips. Apparently, they're not going to release the whole thing. Maybe that's fake news, is it? Well, I don't know. We'll have to see when CNN actually airs it at nine o'clock coming up. I think you'd be able to tell if there were some edits there. And I think you're dead on about the set that they're using there. I mean, it looks like they went into some kind of WeWork space or something like that. I mean, what a nondescript... You would think for such an anticipated thing that they have so controlled every aspect of her post ever since she became the presumed nominee, they've controlled every minutiae, all the minutiae of it. Why would they pick that spot and that setting? It looks horrible on TV. It just looks terrible. Yes. She looks like she's sitting there with her lawyer in traffic court, and that's like a pre-trial thing, and they're hoping to get the speeding ticket dismissed. That's what it looks like right there. But her thing, the one clip that they released, \"My values haven't changed,\" it's pretty obvious that that's an answer that they workshopped quite a bit to land on that. Because obviously, she has never held the positions that her campaign is now claiming that she holds. She supports fracking now, give me a break. She does not support fracking, and Fox is running around calling it a flip-flop. She doesn't believe these things. If you say it's a flip-flop, it gives her credit for having these positions. We don't believe that these are her positions. It's the ones that she's had for decades. So when she says, \"My values haven't changed,\" well, then how on earth do you explain these 180-degree turns from what her old position used to be to what it supposedly is now? That means that she's even worse. That makes her more untrustworthy. If her values haven't changed, but she's still wildly changing her positions on certain very important policies, then you super-duper can't trust her. We knew that you couldn't trust her before, but now she's actually telling us, \"I don't believe these things that I'm saying.\" Because if she says her values haven't changed, then what she says today cannot possibly be true. You can't trust her. So that's the point. The thing I can't get over, Tim, and perhaps you could elucidate for me, how we are supposed to trust somebody whose party has been in power for 12 of the last 16 years, who says they're going to fix an America in shambles, and expresses that they are the ones, certainly not them, are the ones who are to blame for all of this. I can't justify it. Maybe it's working with some people. Maybe it is clicking with some people, that they don't blame Kamala Harris for the last 16 years of unified party Democrat control of the country. I mean, is this going to fly? And by the way, she's for a border wall now, which is crazy. Wow. Yeah. That's what I'm saying. When she says my values haven't changed, well, her old value, or at least the one we know about, was that the border wall is un-American. That's what she said. It's un-American. So if her values haven't changed, yet she claims to support the border wall now, how do you square those two things? It means she's a complete and utter phony, and she's actually admitting it. So I don't know how they think that these things are going to land. I'm not sure that this is a really high-quality strategy they've got here, but I'm afraid that they're saddled with the candidate who is, in fact, god-awful. There is a reason, Benny, why she withdrew from the presidential primaries in the 2020 Democratic primaries before it was even 2020. She quit in December of 2019, and there's a reason why she left the race with basically zero percent. It's because she's a bad candidate. She couldn't even survive in the field of Democratic candidates when she was pushing everything to the left. She's a California Democrat. She has never before ever carried an election on her own. When she ran nationally with Joe Biden, of course, she was running for vice president. She has never been the principal candidate on the ballot outside of California. And she's about to find out just how out of step her crazy leftist California view is. She's a San Francisco liberal, and she's pretending not to be one. That's her biggest problem. So let's talk through some of the polls today. Al, I know that you've been posting quite a few of them. Nate Silver has now Donald Trump back on top. It seems like there was no bump from the DMC convention. That's got to be very alarming for Kamala Harris and her team, along with the RFK endorsement of Donald Trump. Yeah, I would think that they are sort of in a panic mode over there, because Nate Silver's thing today, he had an extensive analysis of Pennsylvania. And Pennsylvania for Kamala Harris may be the whole ballgame. I think it's pretty clear, it's conventional wisdom, that everyone believes that the Democrats cannot win if they do not win Pennsylvania. They must win Pennsylvania. Now winning Pennsylvania does not guarantee victory for them, but they can't win without it. And Nate Silver at FiveThirtyEight had an extensive analysis today, and he's got Pennsylvania firmly in Donald Trump's camp. And if that holds, and I don't see any reason why it wouldn't, then Kamala Harris is really up against it. Because in Pennsylvania, she's going to do one of these things where she's going to have to go out there and try to get people to believe that she thinks certain things that everyone knows that she does not think. Like she's got to go to Pennsylvania and say, \"I support fracking,\" when she doesn't. She has to tell those workers in Western Pennsylvania, \"Hey, I'm looking out for your job in the natural gas industry,\" when she is not looking out for them, has not looked out for them, and will not look out for them. She's not good. You can tell. Every time she gets caught in these catchphrase loops, it's because she's talking about subject matter with which she's not very comfortable or familiar. And if she has to go to Western PA and look these natural gas workers in the face and say, \"I support your industry. I love fracking,\" no one's going to buy it because it's not true. It simply is not true. So Pennsylvania is a real big problem for her. And unfortunately for her, it means everything. It is 100% of the race. She might as well be running for the president of Pennsylvania, and she's not going to do it. There's no way she can get across the finish line because of the positions that she has always had. And it's not fooling anybody to say, \"Oh, you know what? 39 days ago, I woke up and I thought, 'Oh my gosh, I love fracking now. Who's going to buy that?'\" No one. You can see here, I mean, this is relatively disastrous. After the DNC convention, Joe Biden was up by 10 points on President Trump. Hillary Clinton was up by over 10 points on President Trump. Donald Trump would go on to win that race and would go on to win Pennsylvania, as you're talking about. And now you can see that Harris got no, Harris actually went down during the DNC convention, which lends to an interesting paradox here for Democrats, which is that the more people see of her, the more they dislike her. Right. Now, remember, this is exactly what happened in 2019. She started off, when she entered the race back then, she started off as kind of a buzzy candidate. There was a lot of buzz around Kamala Harris. The media was really focused on her as somebody who might be a real comer in the party, and they thought that maybe this is one of the ones who might be able to go to the distance and be one of the last few standing when they're trying to figure out exactly who was going to be the nominee back then. But she had that initial buzz. And then as soon as people started to get a look at her and watch her act, it began to quickly fall down and fall down and fall down. And next thing you know, she's at 0.5 percent before Iowa. And see you later. She's out of there. The same thing is happening now. The whole thing, her whole rise has been media fueled. It's a total sugar high. There's nothing inside this package that she and the media have carefully concocted. And we're going to see later tonight. It's not a performance problem. It's not like Joe Biden when he was in the debate where he could at any moment perform an actual face plant, right? Like a literal falling over and whacking his face on the floor. That could have happened. Right. We watched it happen. Actually. Yeah. It practically did. Yeah. But that's not Kamala Harris's problem. Her problem is not going out there and falling down or looking bewildered or any of those things. It's the content of what she says and the way that she says it and how you can tell that she's just absolutely full of it. Or you can also tell when she has no earthly idea what she's talking about. That's her problem. And now she's got to convince people that she believes something that she has never believed on like 20 different topics. It's a tall order for somebody who's good at politics. She's not good at politics. No way she's able to pull this off. Tim, since you just brought that up, I have to play you this very short 15 second clip from Kamala Harris. Just moments ago. We were at a rally where a lot of people were bussed in. We know that we have the local news cameras, like big buses taking people and maybe get your comment on that. But more importantly, you're a communications expert. This is your trade, your profession, the words that are coming out of a politician's mouth. Can you please make any sense of this? He even called for termination of the United States Supreme, the supreme land of our nation, the United States Constitution. What, what, what, what just happened? I got nothing. Yeah, I don't know. I don't know what she's talking about. She I mean, is she trying to he's going to what terminate the land of the United States or the supreme what? I don't know. I don't know what she's trying to talk about. Is she she alleging that somehow Donald Trump is going to what outlaw the Constitution? I don't know. I'm not sure exactly what she's going for there. You see, when she gets off teleprompter, she had a thread of a thought and then it was gone. And now she's out of her depth and she can't recover, you know. So that's the thing when she when she's talking about these issues, for example, on the border, I would love to hear her give an off script off teleprompter recitation of exactly why she supports Donald Trump's border wall after she called it un-American. There is no way she can give a credible defense of why it's important to build the border wall after spending years, years denigrating it as a waste of money, un-American. It's racist and blah, blah, so on and so forth. All the terrible things she said about it. Now she wants people to believe that she supports it. She uses images of it in her television ads. I mean, the whole thing is a farce. It's like a Saturday Night Live sketch. Honestly, God, you would be making up a candidate. This is a candidate who is now that she has become the nominee. Now they've set out to design a candidate, one who can get elected because the California Democrat cannot get elected, a lefty from California cannot get elected. But she's their candidate, so they have to un-California-ize her, I guess, if that's such a thing. But that's what they're trying to do. They're trying to get rid of all the crazy positions that she had. And that's why they've spent the last 39 days trying to lay the groundwork to make sure that the staff, not her, but that the staff tells the media, oh, yeah, she's changed her mind and all those things, because they knew she couldn't handle it. And they wanted the groundwork to be laid before she finally emerged. Now she's doing this interview with Tim Walz, who is basically a stand-in for her. He's like a human body pillow for her, so she can hug it if she gets nervous, right? That's his role there. And his thing, the unpaid volunteer assistant football coach running around like he's Andy freaking Reed. Who's buying that? What a phony that guy is, too. The two of them together are the phoniest, most deceitful presidential ticket in modern American history. It's really disgraceful, and it's actually frightening, the deception that they're attempting to pull off. It really is frightening. Think about it. She's running as something 100% phony candidate. All of her positions are phony, her act is phony, her running mate is phony, the way she became the nominee is phony, all of it, every bit of it. She helped lie to the country to cover up Joe Biden's decrepitude. That's phony. I've never seen anything so dishonest from beginning to end as this. [BLANK_AUDIO]"
}
}